# -*- coding: utf-8 -*-

#---------------------- 定数 ------------------------------
master_size_origin = [792,547]
stats_size_origin = [180,50]
corner_size_origin = 10
line_size_origin = 18
master_size_min = [99,68]
fontsize_max = 200
precomposed_table_size = [2,6,9]
tile_pos_origin = [
  [[480,366],[480,56]], #2
  [], #3
  [], #4
  [], #5
  [[306,429],[0,332],[0,160],[306,0],[612,160],[612,332]], #6
  [], #7
  [], #8
  [[306,429],[80,387],[0,271],[0,158],[38,24],[582,24],[612,158],[612,271],[532,387]] #9
  ]
line_pos = [[5,5],[5,27]]
ACTION_STR = ["レイズ","ベット","フォールド","チェック","コール"]

#---------------------- グローバル変数 ------------------------------
username = ""
all_players = {}
